{
	"personalInfo": {
		"name": "Fabian Buentello",
		"city": "Houston, TX",
		"title": "Software Developer",
		"personalText": "Ambitious developer passionate about creating Mobile and Web experiences for users. I enjoy working on projects that challenge me not only as a developer, but as a person as well. I find no pleasure in developing new technology using old languages. I am constantly pushing myself to learn new techniques to better myself as a developer."
	},
	"skills" :
	[{
		"fontAwesome":"fa fa-mobile fa-5x",
		"title": "Mobile",
		"text": "Developing for both iOS and Android is by far the most exciting type of development for me. I have developed from a fully native social networking app to communicating via Bluetooth between mobile devices and micro-controllers."
		},{
			"imgURL": "assets/svg/programming.svg",
			"title": "Programming",
			"text": "Have a strong fundamental understanding of languages such as Java, C, and C++. Have used these languages to build native applications for Mac and PC. Along with using C++ to program mBed micro-controllers."
			},{
				"imgURL": "assets/svg/circuit.svg",
				"title": "Hardware",
				"text": "Experience with micro-controllers from manufactures like Arduino, BeagleBone, Raspberry Pi, mBed, and Texas Instruments. Experiments include using relays to control components such as servos, motors, and solenoids."
			},{
				"fontAwesome": "fa fa-code fa-5x",
				"title": "Front End",
				"text": "From HTML,CSS, and JS to more advance frameworks such as Angular.js and LESS. I am constantly learning new ways to implement old methods. I look forward to what new challenges web development brings me."
			},{
				"fontAwesome": "fa fa-terminal fa-5x",
				"title":"Back End",
				"text": "With early experiences with scripting languages such as PHP to now deploying a server in a matter of minutes with Node.js or Ruby on Rails. Developing scalable backends with robust API's is one of my main passion."
			},{
				"fontAwesome": "fa fa-database fa-5x",
				"title": "Database",
				"text": "Currently am using NoSQL databases similar to MongoDB since they go hand in hand with Node.js. I do have a strong understanding of SQL databases from my experience developing a social networking application."
			}]
		}